index=windows sourcetype=WinEventLog:Security EventCode=4624 LogonType=3 AuthenticationPackageName=NTLM LmPackageName="NTLM V2"
| where NOT match(SubjectUserName,"\$$") AND SubjectUserName != "ANONYMOUS LOGON"
| table _time, SubjectUserName, Computer, IpAddress, IpPort, WorkstationName
| sort -_time
