index=windows sourcetype=WinEventLog:Security EventCode=4625
| bucket _time span=10m
| stats dc(TargetUserName) AS UniqueAccounts by IpAddress, _time
| where UniqueAccounts > 20
| sort -UniqueAccounts
| table _time, IpAddress, UniqueAccounts
